In [12]:
import pandas as pd

In [13]:
data ={'a':[1,2,3,4],
       'b':[4,5,6,7],
       'c':["subh",'silki','giti','poo']}

In [14]:
data

{'a': [1, 2, 3, 4], 'b': [4, 5, 6, 7], 'c': ['subh', 'silki', 'giti', 'poo']}

In [15]:
df = pd.DataFrame(data)
df

   a  b      c
0  1  4   subh
1  2  5  silki
2  3  6   giti
3  4  7    poo

In [16]:
df.set_index('c',inplace=True)

In [17]:
df

       a  b
c
subh   1  4
silki  2  5
giti   3  6
poo    4  7

In [18]:
df.reset_index()

       c  a  b
0   subh  1  4
1  silki  2  5
2   giti  3  6
3    poo  4  7

In [19]:
data ={'a':[1,2,3,4],
       'b':[4,5,6,7],
       'c':["subh",'silki','giti','poo']}
df1 = pd.DataFrame(data,index=['a','b','c','d'])

In [20]:
df1

   a  b      c
a  1  4   subh
b  2  5  silki
c  3  6   giti
d  4  7    poo

In [21]:
df1.reindex(['b','c','a','d'])

   a  b      c
b  2  5  silki
c  3  6   giti
a  1  4   subh
d  4  7    poo

In [22]:
df.iterrows()

In [23]:
for i in df1.iterrows():
    print(i)

('a', a       1
b       4
c    subh
Name: a, dtype: object)
('b', a        2
b        5
c    silki
Name: b, dtype: object)
('c', a       3
b       6
c    giti
Name: c, dtype: object)
('d', a      4
b      7
c    poo
Name: d, dtype: object)

In [24]:
for i in df1.itertuples():
    print(i)

Pandas(Index='a', a=1, b=4, c='subh')
Pandas(Index='b', a=2, b=5, c='silki')
Pandas(Index='c', a=3, b=6, c='giti')
Pandas(Index='d', a=4, b=7, c='poo')

In [25]:
def test (x):
    return x.sum()
df1.apply(test ,axis=0)

a                  10
b                  22
c    subhsilkigitipoo
dtype: object

In [26]:
df2 = df1[['a','b']]

In [27]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [28]:
df2 = df1[['a','b']]
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [29]:
df2.apply(lambda x: x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [30]:
df1.sort_values('c')

   a  b      c
c  3  6   giti
d  4  7    poo
b  2  5  silki
a  1  4   subh

In [31]:
df1.sort_index(ascending=False)

   a  b      c
d  4  7    poo
c  3  6   giti
b  2  5  silki
a  1  4   subh

In [32]:
df3 = pd.DataFrame({"desc": [" A paragraph is a series  of sentence that are orgained and coherent ,and all related to a single topic"]})
## Here we have given a compelet paragraph  as a string and print but it dont print whole paragraph.

In [33]:
df3

                                                desc
0   A paragraph is a series  of sentence that are...

In [34]:
pd.set_option("display.max_colwidth",500)
df3=pd.DataFrame({"desc": [" A paragraph is a series  of sentence that are orgained and coherent ,and all related to a single topic"]})
df3
## here we inc the length of max_colwidth to 500 so now it will print whole para.

                                                                                                      desc
0   A paragraph is a series  of sentence that are orgained and coherent ,and all related to a single topic

In [35]:
df3['char_len_data'] = df3['desc'].apply(len)
df3

,desc,char_len_data
0,"A paragraph is a series of sentence that are orgained and coherent ,and all related to a single topic",103

In [36]:
t = 'i use to take data science master class'
len(t.split())
# it number of peresent in the given string

8

In [37]:
df3['word_count'] = df3['desc'].apply(lambda x: len(x.split()))
df3

,desc,char_len_data,word_count
0,"A paragraph is a series of sentence that are orgained and coherent ,and all related to a single topic",103,19

In [38]:
df3

,desc,char_len_data,word_count
0,"A paragraph is a series of sentence that are orgained and coherent ,and all related to a single topic",103,19

In [39]:
df1['a'].mean()

2.5

In [40]:
df1['a'].median()

2.5

In [41]:
df1['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [42]:
df1['a'].std()

1.2909944487358056

In [43]:
df1['a'].min()

1

In [44]:
df1['a'].max()

4

In [45]:
df1['a'].sum()

10

In [46]:
df1['a'].var()

1.6666666666666667

In [47]:
# python pandas _ window functon
df4 = pd.DataFrame({'a':[1,2,3,4,5,6,7,8,9]})
df4

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [48]:
df4.rolling(window=1).mean()

     a
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [49]:
df4.rolling(window=2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5
8  8.5

In [50]:
df4.rolling(window=3).mean()

     a
0  NaN
1  NaN
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [51]:
df4.cumsum()

    a
0   1
1   3
2   6
3  10
4  15
5  21
6  28
7  36
8  45

In [52]:
df_date= pd.DataFrame({"date":data})
df_date

                       date
a              [1, 2, 3, 4]
b              [4, 5, 6, 7]
c  [subh, silki, giti, poo]

In [56]:
# python pandas - Data Functionallity
data =pd.date_range(start='2020-02-01',end='2020-02-10')
data

DatetimeIndex(['2020-02-01', '2020-02-02', '2020-02-03', '2020-02-04',
               '2020-02-05', '2020-02-06', '2020-02-07', '2020-02-08',
               '2020-02-09', '2020-02-10'],
              dtype='datetime64[ns]', freq='D')

In [57]:
df_date = pd.DataFrame({'data': data})
df_date

        data
0 2020-02-01
1 2020-02-02
2 2020-02-03
3 2020-02-04
4 2020-02-05
5 2020-02-06
6 2020-02-07
7 2020-02-08
8 2020-02-09
9 2020-02-10

In [59]:
df_date.dtypes

data    datetime64[ns]
dtype: object

In [60]:
df7 = pd.DataFrame({"data" : ['2020-02-01','2020-02-02','2020-02-03']})
df7

         data
0  2020-02-01
1  2020-02-02
2  2020-02-03

In [61]:
df7.dtypes

data    object
dtype: object

In [62]:
df7['update'] = pd.to_datetime(df7['data'])
df7

         data     update
0  2020-02-01 2020-02-01
1  2020-02-02 2020-02-02
2  2020-02-03 2020-02-03

In [63]:
df7['year']= df7['update'].dt.year
df7

         data     update  year
0  2020-02-01 2020-02-01  2020
1  2020-02-02 2020-02-02  2020
2  2020-02-03 2020-02-03  2020

In [64]:
df7['day_name']= df7['update'].dt.day_name()
df7

         data     update  year  day_name
0  2020-02-01 2020-02-01  2020  Saturday
1  2020-02-02 2020-02-02  2020    Sunday
2  2020-02-03 2020-02-03  2020    Monday

In [65]:
# pandas - Time Deltas

In [66]:
pd.Timedelta(days=1,hours=5, minutes=55)

Timedelta('1 days 05:55:00')

In [67]:
time = pd.Timedelta(days=1,hours=5, minutes=55)
dt = pd.to_datetime("2020-02-01")
dt+time

Timestamp('2020-02-02 05:55:00')

In [68]:
pd.Timedelta(days=1,hours=5, minutes=55)

Timedelta('1 days 05:55:00')

In [69]:
# pandas - Categorical Data

In [70]:
data = ['silki','poo','santo','yogi','soham']
pd.Categorical(data)

['silki', 'poo', 'santo', 'yogi', 'soham']
Categories (5, object): ['poo', 'santo', 'silki', 'soham', 'yogi']

In [71]:
cat = pd.Categorical(data)

In [72]:
cat.value_counts()

poo      1
santo    1
silki    1
soham    1
yogi     1
Name: count, dtype: int64

In [73]:
d= pd.Series([1,2,3,4,5,6,7,8])
d

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

SyntaxError: invalid syntax (3288361553.py, line 1)